#На языке Питон написать программу, которая из файла читает объекты, разделенные  пробелами, выводит их на экран,
# производит заданную обработку и результат выводит на экран.
# Обработка: найти сумму и количество вещественных десятичных чисел, в которых первая цифра в дробной части равна 5.

import re
while True:
    file_name = input('Введите название файла с его расщирением: ')
    try:
        with open(file_name, 'r') as file:
            text = file.read().split(' ')
    except:
        print('Такого файла не существует')
        continue
    break

answer = []
sum_answer = 0.0
for i in text:
    if re.fullmatch('[+-]?(\d+\.\d+)', i):
        if i[i.find('.') + 1] == '5':
            sum_answer += float(i)
            answer.append(i)

print(answer)
print('Кол-во количество вещественных десятичных чисел, в которых первая цифра в дробной части равна 5: ', len(answer))
print('Сумма вещественных десятичных чисел, в которых первая цифра в дробной части равна 5 :', sum_answer)